package org.example.weiwang.Config;

public class Config {
    public static String[][] devices = {
            {"08102100002009","1#生产总电(1级)","400"},
            {"08102100002140","1#生产总电_1","400"},
            {"08102100002070","办公用电","30"},
            {"08102100002178","水处理","50"},
            {"08102100002131","上引炉","300"},
            {"08102100001993","1#熔化炉","160"},
            {"08102100002064","2#熔化炉","160"},
            {"08102100002043","保温炉","160"},
            {"08102100002200","水泵","80"},
            {"08102100002093","空压机","30"},
            {"08102100002254","鼓风除尘","1"},
            {"08102100002022","2#生产总电","300"},
            {"08102100002269","2期熔化1","80"},
            {"00000000001963","2期熔化2","80"},
            {"08102100002673","2期保温1","80"},
            {"08102100002021","2期保温2","80"},
            {"08102100002321","储能1","160"},
            {"08102100002922","储能2","240"},
            {"08102100002146","光伏1","300"},
            {"08102100002956","光伏3","400"},
            {"08102100002130","光伏2","100"},
            {"08102100002180","2#柴油发电机","300"},
            {"08102100002204","2期上引操作台","1"},
            {"868909072294161","纯美1","120"},
            {"868909072285730","纯美2","120"},
            {"868909072269536","纯美3","80"},
            {"868909072285821","纯美4","80"},
            {"868909072287033","凯硕1","80"},
            {"868909072258083","凯硕2","300"},
            {"868909072286712","环辰","50"},
            {"868909072285839","凯硕3","80"},
            {"868909072294179","凯硕4","300"},
            {"868909072258091","凯硕5","300"},
            {"868909072219457","金晟业","80"},
            {"868909072286704","凯硕6","300"},
            {"3411112207","保安室","60"},
            {"3411112117","德尔玛3楼","20"},
            {"3409236134","楼照明总表","40"}
    };
    public static String[][] IOCname={
            {"Net1.光伏.设备_1@阳光逆变器2NB01_总有功功率","200000001","Net1.光伏.设备_1@阳光逆变器2NB01_日发电量","Net1.光伏.设备_1@阳光逆变器2NB01_月发电量","Net1.光伏.设备_1@阳光逆变器2NB01_总发电量"},
            {"Net1.光伏.设备_1@阳光逆变器2NB02_总有功功率","200000002","Net1.光伏.设备_1@阳光逆变器2NB02_日发电量","Net1.光伏.设备_1@阳光逆变器2NB02_月发电量","Net1.光伏.设备_1@阳光逆变器2NB02_总发电量"},
            {"Net1.光伏.设备_1@阳光逆变器2NB03_总有功功率","200000003","Net1.光伏.设备_1@阳光逆变器2NB03_日发电量","Net1.光伏.设备_1@阳光逆变器2NB03_月发电量","Net1.光伏.设备_1@阳光逆变器2NB03_总发电量"},
            {"Net1.光伏.设备_1@阳光逆变器2NB04_总有功功率","200000004","Net1.光伏.设备_1@阳光逆变器2NB04_日发电量","Net1.光伏.设备_1@阳光逆变器2NB04_月发电量","Net1.光伏.设备_1@阳光逆变器2NB04_总发电量"},
            {"Net1.光伏.设备_1@阳光逆变器2NB05_总有功功率","200000005","Net1.光伏.设备_1@阳光逆变器2NB05_日发电量","Net1.光伏.设备_1@阳光逆变器2NB05_月发电量","Net1.光伏.设备_1@阳光逆变器2NB05_总发电量"},
            {"Net1.光伏.设备_1@阳光逆变器2NB06_总有功功率","200000006","Net1.光伏.设备_1@阳光逆变器2NB06_日发电量","Net1.光伏.设备_1@阳光逆变器2NB06_月发电量","Net1.光伏.设备_1@阳光逆变器2NB06_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB01_总有功功率","100000001","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB01_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB01_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB01_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB02_总有功功率","100000002","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB02_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB02_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB02_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB03_总有功功率","100000003","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB03_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB03_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB03_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB04_总有功功率","100000004","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB04_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB04_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB04_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB05_总有功功率","100000005","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB05_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB05_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB05_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB06_总有功功率","100000006","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB06_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB06_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB06_总发电量"},
            {"Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB07_总有功功率","100000007","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB07_日发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB07_月发电量","Net1.光伏.设备_1@2专用配电房_阳光逆变器1NB07_总发电量"},
            {"Net1.串口服务器_第1路.2000变总电表@三相总有功功率","000000001"},
            {"Serial5.500kVA变压器总电表@三相总有功功率","000000003"},
            {"Serial5.1000KVA变总电表@三相总有功功率","000000002"},
            {"Net1.1号厂房储能组_1号.储能柜1@PCS1_交流输出总有功功率","1111111111","null","null","null","Net1.1号厂房储能组_1号.储能柜1@PCS1_交流日充电电量","Net1.1号厂房储能组_1号.储能柜1@PCS1_交流日放电电量","Net1.1号厂房储能组_1号.储能柜1@PCS1_交流累计充电电量","Net1.1号厂房储能组_1号.储能柜1@PCS1_交流累计放电电量"},
            {"Net1.1号厂房储能组_2号.储能柜_2@PCS1_交流输出总有功功率","1111111112","null","null","null","Net1.1号厂房储能组_2号.储能柜_2@PCS1_交流日充电电量","Net1.1号厂房储能组_2号.储能柜_2@PCS1_交流日放电电量","Net1.1号厂房储能组_2号.储能柜_2@PCS1_交流累计充电电量","Net1.1号厂房储能组_2号.储能柜_2@PCS1_交流累计放电电量"},
            {"Net1.1号厂房储能组_3号.储能柜_3@PCS1_交流输出总有功功率","1111111113","null","null","null","Net1.1号厂房储能组_3号.储能柜_3@PCS1_交流日充电电量","Net1.1号厂房储能组_3号.储能柜_3@PCS1_交流日放电电量","Net1.1号厂房储能组_3号.储能柜_3@PCS1_交流累计充电电量","Net1.1号厂房储能组_3号.储能柜_3@PCS1_交流累计放电电量"},
            {"Net1.1号厂房储能组_4号.储能柜_4@PCS1_交流输出总有功功率","1111111114","null","null","null","Net1.1号厂房储能组_4号.储能柜_4@PCS1_交流日充电电量","Net1.1号厂房储能组_4号.储能柜_4@PCS1_交流日放电电量","Net1.1号厂房储能组_4号.储能柜_4@PCS1_交流累计充电电量","Net1.1号厂房储能组_4号.储能柜_4@PCS1_交流累计放电电量"},
            {"Net1.1号厂房储能组_5号.储能柜_5@PCS1_交流输出总有功功率","1111111115","null","null","null","Net1.1号厂房储能组_5号.储能柜_5@PCS1_交流日充电电量","Net1.1号厂房储能组_5号.储能柜_5@PCS1_交流日放电电量","Net1.1号厂房储能组_5号.储能柜_5@PCS1_交流累计充电电量","Net1.1号厂房储能组_5号.储能柜_5@PCS1_交流累计放电电量"},
            {"Net1.1号厂房储能组_6号.储能柜_6@PCS1_交流输出总有功功率","1111111116","null","null","null","Net1.1号厂房储能组_6号.储能柜_6@PCS1_交流日充电电量","Net1.1号厂房储能组_6号.储能柜_6@PCS1_交流日放电电量","Net1.1号厂房储能组_6号.储能柜_6@PCS1_交流累计充电电量","Net1.1号厂房储能组_6号.储能柜_6@PCS1_交流累计放电电量"},
            {"Net1.2号厂房储能组_7号.储能柜_7@PCS1_交流输出总有功功率","1111111117","null","null","null","Net1.2号厂房储能组_7号.储能柜_7@PCS1_交流日充电电量","Net1.2号厂房储能组_7号.储能柜_7@PCS1_交流日放电电量","Net1.2号厂房储能组_7号.储能柜_7@PCS1_交流累计充电电量","Net1.2号厂房储能组_7号.储能柜_7@PCS1_交流累计放电电量"},
            {"Net1.2号厂房储能组_8号.储能柜_8@PCS1_交流输出总有功功率","1111111118","null","null","null","Net1.2号厂房储能组_8号.储能柜_8@PCS1_交流日充电电量","Net1.2号厂房储能组_8号.储能柜_8@PCS1_交流日放电电量","Net1.2号厂房储能组_8号.储能柜_8@PCS1_交流累计充电电量","Net1.2号厂房储能组_8号.储能柜_8@PCS1_交流累计放电电量"},
            {"Net1.2号厂房储能组_9号.储能柜_9@PCS1_交流输出总有功功率","1111111119","null","null","null","Net1.2号厂房储能组_9号.储能柜_9@PCS1_交流日充电电量","Net1.2号厂房储能组_9号.储能柜_9@PCS1_交流日放电电量","Net1.2号厂房储能组_9号.储能柜_9@PCS1_交流累计充电电量","Net1.2号厂房储能组_9号.储能柜_9@PCS1_交流累计放电电量"},
            {"Net1.2号厂房储能组_10号.储能柜_10@PCS1_交流输出总有功功率","11111111110","null","null","null","Net1.2号厂房储能组_10号.储能柜_10@PCS1_交流日充电电量","Net1.2号厂房储能组_10号.储能柜_10@PCS1_交流日放电电量","Net1.2号厂房储能组_10号.储能柜_10@PCS1_交流累计充电电量","Net1.2号厂房储能组_10号.储能柜_10@PCS1_交流累计放电电量"},

    };
    public static String[][] bit={
            {"000000000","000000001","000000002","000000003"},
            {"000000001","08102100002922","08102100002956"},
            {"000000002","08102100002009","08102100002146","08102100002922"},
            {"000000003","08102100002130",},
            {"08102100002022","00000000001963","08102100002673","08102100002204","08102100002269","08102100002021"},
            {"08102100002009","08102100002178","08102100002131"},
            {"08102100002922","1111111111","1111111112","1111111113","1111111114","1111111115","1111111116"},
            {"08102100002956","100000002","100000003","100000004","100000005","100000006","100000007","100000001"},
            {"08102100002178","08102100002200","08102100002254"},
            {"08102100002131","08102100002064","08102100001993","08102100002043"},
            {"08102100002146","200000001","200000002","200000003","200000004"},
            {"08102100002321","1111111117","1111111118","1111111119","11111111110"},
            {"08102100002130","200000005","200000006"},
    };

    public static String[][] bian1= {
            {"000000001", "868909072287033", "868909072258083", "868909072285839", "868909072294179", "868909072258091", "868909072286704", "08102100002022", "3411112117", "3411112207", "868909072219457", "868909072286712", "3409236134", "08102100002070"},
            {"000000003", "868909072294161", "868909072285730", "868909072269536", "868909072285821"},
    };
    //光伏、储能多用途
    public static String[] calculate={"08102100002321","08102100002922","08102100002146","08102100002956","08102100002130","000000001","000000002","000000003","08102100002009"};

    //光伏、储能获取每5分钟的电量
    public static String[] mixed={"08102100002321","08102100002922","08102100002146","08102100002956","08102100002130","000000001","000000002","000000003","08102100002009",
            "868909072287033","868909072258083","868909072285839","868909072294179","868909072258091","868909072286704","3411112117","3411112207",
            "3409236134","868909072219457","868909072286712","868909072294161","868909072285730","868909072269536","868909072285821"};


    public static String[] guang={"08102100002130","08102100002146","08102100002956"};

    public static String[] bian2={"000000001","000000002","000000003"};

    public static String[] chuneng={"08102100002321","08102100002922"};

    public static String[] zhujian1={"000000001","08102100002956","08102100002922"};

    //外租单位的表，进行15分钟、1小时等的计算
    public static String[] waizu=
            {"868909072287033","868909072258083","868909072285839","868909072294179","868909072258091","868909072286704","3411112117","3411112207",
                    "3409236134","868909072219457","868909072286712","868909072294161","868909072285730","868909072269536","868909072285821"};





}
